app/controllers/api/businesses_controller.rb

SELECT  "businesses".* FROM "businesses" WHERE "businesses"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
    def show
        @business = Business.with_attached_photos.find_by(id: params[:id])

SELECT "businesses".* FROM "businesses"
---
    def index
        @businesses = Business.all